
from ai_pipeline.llm import vision_llm , text_llm ,gemini_client
from ai_pipeline.extractors.document_processor import DocumentIntakeProcessor
import pdfplumber
from pdf2image import convert_from_path
import os 
from dotenv import load_dotenv
load_dotenv()
from .tasks import hello

hello.delay()

# vision_llm = vision_llm
# text_llm = text_llm

# p=DocumentIntakeProcessor(vision_llm,text_llm,gemini_client)
# file_path=r"F:/ITI/GRADUATION PROJECT/code/ITI_Graduation_Project/test.pdf"



# poppler_path=os.getenv("POPPLER_PATH")
# page_image=convert_from_path(file_path,first_page=1,last_page=1,poppler_path=poppler_path)[0]
# ocr_data=p._extract_scanned_pdf_via_vision(page_image)
# print(ocr_data)


# with pdfplumber.open(file_path) as pdf:
# # d= [{'page': 1, 'type': 'scanned', 
# #      'extraction_metadata': 
# #          {'confidence_score': 98, 'needs_human_review': False, 'review_reason': '', 'unclear_sections': []}, 
# #          'content': 'SC°ZONE\'\nSCZONE.EG\n\nالمنطقة الاقتصادية\nلقناة السويس\nSUEZ CANAL ECONOMIC ZONE\n\n3. بيان الأصناف المطلوبة\n3.1 بيان الأصناف والكميات والمواصفات الفنية للأصناف المطلوب توريدهم\n\nأ) الأجهزة المساحية المطلوب توريدها:\n\n3.2 الشروط الخاصة بالتوريد\n\n(1) يجب تقديم كتالوجات موضح بها الأجهزة المساحية المتوفرة للاختيار بينهم.\n(2) يجب أن تكون الأجهزة أصلية ومعتمدة من وكيل أو موزع من الشركة المنتجة.\n(3) أن تكون مناسبة لظروف التشغيل في مصر.\n(4) توفير عدد (3) جهاز Laptop ويتم توزيعهم على المناطق الصناعية بالقنطرة غرب -الشمالية -الجنوبية)\nبمواصفات للأعمال الهندسية على من يرسو عليه بند جهاز تحديد المواقع GPS بالمواصفات الآتية: -\nأ - لا يقل عن Core i7\nب - رامات 32 جيجا DDR5\nجـ - NVIDIA RTX 3060 8GB\nد - وحدة تخزين داخلية 1 تيرا بايت\nهـ - وحدة تخزين خارجية 512 GB USB\nو - محمل عليه جميع البرامج الهندسية مع رخص تشغيلها وتحديثها لمدة 5 سنوات\n(AutoDesk " CAD-CIVIL 3D " – Google Earth – Global Mapper – TBC – Spectrum\nLink –ArcGIS Pro )\n\n(5) أن تكون الأجهزة بالمواصفات الآتية:\nأ - جهاز تحديد المواقع GPS (لكل جهاز):\n(1) لا يقل مدى الراديو الداخلي للوحدة عن 5 كم.\n(2) توفير عدد (6) بطارية.\n(3) توفير عدد (1) Dell Latitude 12 Windows 10 Rugged\nTouchscreen Tablet 8GB RAM 128GB SSD GENUINE.\n(4) توفير عدد (2) عصا تسامت من مادة الكاربون فايبر بطول لا يقل عن 2 متر.\n(5) توفير عدد (2) شاحن.\n\n23 / 14\nم.س - نسخة رقم 1.0\nالتداول : بين الأطراف\n\nالإدارة العامة للتعاقدات\nكراسة الشروط للمناقصة العامة رقم (14) لسنة 2026/2025', 'tables': [[['م', 'اسم البند', 'الوحدة', 'الكمية', 'الملاحظات'], ['1', 'جهاز تحديد المواقع GPS', 'بالعدد', '3', ''], ['2', 'جهاز نقل بيانات (راديو خارجي)', 'بالعدد', '3', ''], ['3', 'محطة رصد متكاملة Total Station', 'بالعدد', '1', ''], ['4', 'ميزان قامة', 'بالعدد', '1', ''], ['5', 'تدريب خارجي - داخلي (اختياري)', 'بالعدد', '5', 'طبقاً لتوافر الأجهزة والبرامج']]]}, {'page': 2, 'type': 'scanned', 'extraction_metadata': {'confidence_score': 98, 'needs_human_review': False, 'review_reason': '', 'unclear_sections': []}, 'content': 'SC°ZNE\'\nSCZONE.EG\nالمنطقة الاقتصادية\nلقن\nالسويس\nSUEZ CANAL ECONOMIC ZONE\n(6) توفير عدد (1) حقيبة GNSS.\n(7) توفير عدد (2) تریبراخ.\n(8) توفير عدد (1) حامل ثنائي.\n(9) توفير عدد (2) حامل ثلاثي خشبي.\n(10) أن يكون الجاهز قابل للرصد المائل.\n(11) أن يكون الجهاز ذات تسامت بصري – ليزر.\n(12) يلتزم من يرسو عليه العطاء توفير النسخة الأصلية من سوفت وير الشركة لأعمال المكتب الفني مرخصة\nومجددة لمدة 5 سنوات والتجديد بعد انتهاء الفترة.\nب- جهاز محطة الرصد المتكاملة TOTAL Station.\n(1) توفير مجموعه من العواكس "Mini-Prism" بعدد (6).\n(2) توفير مجموعه من العواكس "Prism" بعدد (6).\n(3) توفير عدد (4) بطارية.\n(4) ان يكون دقة الجهاز 2 ث فيما أقل.\n(5) لا يقل الرصد بدون عاكس عن 800 متر.\n(6) توفير عدد (2) عصا تسامت من مادة الكاربون فايبر بطول لا يقل عن 2 متر.\n(7) توفير عدد (2) تریبراخ.\n(8) توفير عدد (1) Diagonal Eyepiece " عدسة رؤية بزاوية ".\n(9) توفير عدد (2) حامل ثلاثي خشبي.\n(10) أن يكون الجهاز ذات تسامت بصري – ليزر.\nجـ - جهاز ميزان القامة.\n(1) توفير عدد (2) قامة 7م + عدد (2) قامة 5م.\n(2) أن يكون قوة تكبير المنظار لا يقل عن 32X.\n(3) توفير عدد (2) حامل ثلاثي.\n(4) توفير عدد (2) عجلة قياس.\n(5) توفير عدد (3) متر شريط بطول 50 متر.\n(6) توفير عدد (2) متر ليزر.\n(6) مدة التوريد لا تزيد عن 3 أشهر من اصدار اخطار الترسية.\n(7) مدة الضمان 2 عام من تاريخ التوريد.\n(8) تاريخ الانتاج لا يقل عن عام 2025 م.\n(9) لجنة البت الفني لها حق بمعاينة الاجهزة لإصدار قرارها بالقبول او رفض العرض.\n(10) جميع برامج التشغيل لجميع الأجهزة مرخصة لمدة 5 سنوات وأصلية.\n(11) حق للشركة تقديم اكثر من بديل على ان تلتزم الشركة بتقديم الكتالوجات بكل البدائل المقدمة ويجب البديل\nالذي يتوفر، له وكيل معتمد في مصر وتقديم شهادة الضمان من الوكيل.\nالإدارة العامة للتعاقدات\nكراسة الشروط للمناقصة العامة رقم (14) لسنة 2026/2025\n23 / 15\nم.س – نسخة رقم 1.0\nالتداول : بين الأطراف', 'tables': []}, {'page': 3, 'type': 'scanned', 'extraction_metadata': {'confidence_score': 98, 'needs_human_review': False, 'review_reason': '', 'unclear_sections': []}, 'content': 'المنطقة الاقتصادية\nلقناة السويس\nSUEZ CANAL ECONOMIC ZONE\n\nSC°ZINE\'\nSCZONE.EG\n\n4. محتويات المظروف الفني\nيكتب على المظروف الفني الآتي:\nالمناقصة العامة رقم (14) لسنة 2026/2025 م\nبشأن عملية توريد أجهزة مساحية لمتابعة وتنفيذ الأعمال بالمناطق الصناعية التابعة للهيئة\nعطاء شركة )\n"العرض الفني"\n\nيجب على مقدمي العطاءات الفنية التوقيع على كل صفحة من الأصل من المفوض من قبل الشركة.\nيجب أن تبدأ العروض بصفحة المحتويات التي تحدد أرقام صفحات الأقسام المختلفة للعرض، وتكون صفحات العرض\nمطبوعة على جهة واحدة فقط وبمقاس (A4)، التنسيق التلقائي للهوامش بنظام مايكروسوفت اوفيس) ما لم تحتوي تلك\nالصفحات على كتالوجات أو أي بيانات فنية تحتاج لمقاس أوراق مختلف والتي يجب ألا يتجاوز حجمها مقاس A3 ويجب\nأن يغطي العرض البنود المطلوبة بشكل كامل متضمناً المعلومات التفصيلية المطلوبة بكراسة الشروط.\nيحتوي المظروف الفني المقدم من الجهة مقدمة العطاء على البنود الآتية:\n(1 بيانات الجهة مقدمة العطاء.\n(2) مدة التوريد.\n(3) مكان التوريد.\n(4) شروط السداد والدفعات المقدمة\n(5) العروض الفنية للأجهزة.\n\nعلى الجهة مقدمة العطاء الالتزام والحفاظ على الترتيب أعلاه مع وضع فواصل بين كل بند من بنود المظروف وذلك\nلتسهيل عملية التفريغ والتقييم اختصاراً للوقت والمجهود.\nتقدم العطاءات باللغة العربية مع إمكانية استخدام اللغة الإنجليزية للمصطلحات الفنية.\nيجب ترقيم كل الأوراق في محتويات العرض بما فيها الغلاف والفواصل.\n\n4.1 بيانات الجهة مقدمة العطاء\n• تذكر بيانات الجهة مقدمة العطاء.\n• من حق لجنة البت استبعاد الشركات التي لا تقوم بتقديم البيانات كاملة ومعتمدة ومختومة بخاتم الشركة.\n\n4.2 مدة التوريد\nيجب أن يتم توريد الأجهزة المساحية المزمع توريدها بمعرفة الشركة بإدارة المخازن بالمنطقة الشمالية ببورسعيد\nفي مدة أقصاها (3) أشهر) من تاريخ إخطار الترسية.\nمن اخطار من ترسو عليه المناقصة بالترسية المالية خالصة المصروفات أو الرسوم وتغطى الافضلية للبضاعة الموردة في\nمدة أقل.\nفي حالة تأخير المورد في توريد كل الكميات المطلوبة في أمر التوريد أو جزء منها في الميعاد المحدد بالعقد – ويدخل في\nذلك الاصناف المرفوضة – يتم تطبيق ما جاء من غرامات بلائحة المشتريات الخاصة بالهيئة والمقررة بنسبة 1% عن كل\n\nالإدارة العامة للتعاقدات\nكراسة الشروط للمناقصة العامة رقم (14) لسنة 2026/2025\n\nم.س – نسخة رقم 1.0 –\n23 / 16\nالتداول : بين الأطراف', 'tables': []}]
# # # print(p.analyze_extraction_quality(d))
# # cleaned=p.clean_raw_data(d)
# # files=[{
# #     "file_id": 1,
# #     "file_category": "specs",
# #     "content": cleaned
# # }]
# # structured=p.structure_to_unified_json("tender",cleaned)
# # import json

# # # بدل print(ocr_data) القديمة، استخدم دي:
# # print(json.dumps(structured, indent=4, ensure_ascii=False))

